app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2013-07-22 19:58:38.298348') ORDER BY released_on desc

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "movies" SET "image_content_type" = ?, "image_file_size" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = 15  [["image_content_type", "image/jpeg"], ["image_file_size", 8304], ["image_file_name", "wolverine.jpg"], ["updated_at", Tue, 06 Aug 2013 04:15:12 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_content_type", "image_file_name", "image_file_size", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)